In [1]:
import pandas as pd

exam_data = { '이름' : ['주민','승인','아인'],
             '수학' : [90,80,70],
             '영어' : [98,89,95],
             '음악' : [85,90,100],
             '체육' : [100,90,90]}
df = pd.DataFrame(exam_data)
print(df)

   이름  수학  영어   음악   체육
0  주민  90  98   85  100
1  승인  80  89   90   90
2  아인  70  95  100   90

In [2]:
#행렬 바꾸기 ( 전치) 
df.T
df.transpose()

      0   1    2
이름   주민  승인   아인
수학   90  80   70
영어   98  89   95
음악   85  90  100
체육  100  90   90

In [3]:
##인덱스활용
#특정 열을 행 인덱스로 설정

ndf =df.set_index(['이름'])
print(ndf)
ndf2 =df.set_index(['음악'])
print(ndf2)
ndf3 =df.set_index(['수학','음악'])
print(ndf3)

    수학  영어   음악   체육
이름
주민  90  98   85  100
승인  80  89   90   90
아인  70  95  100   90
     이름  수학  영어   체육
음악
85   주민  90  98  100
90   승인  80  89   90
100  아인  70  95   90
        이름  영어   체육
수학 음악
90 85   주민  98  100
80 90   승인  89   90
70 100  아인  95   90

In [4]:
#행인덱스 재배열 reindex. 원하는 인덱스로 재지정
df5 = df.reset_index()
df5

lt=[0,1,2,3,4,5]
df6= df.reindex(lt)
df6

    이름    수학    영어     음악     체육
0   주민  90.0  98.0   85.0  100.0
1   승인  80.0  89.0   90.0   90.0
2   아인  70.0  95.0  100.0   90.0
3  NaN   NaN   NaN    NaN    NaN
4  NaN   NaN   NaN    NaN    NaN
5  NaN   NaN   NaN    NaN    NaN

In [5]:
#나머지 0으로 채운다
df7 = df.reindex(lt,fill_value=0) 
df7

   이름  수학  영어   음악   체육
0  주민  90  98   85  100
1  승인  80  89   90   90
2  아인  70  95  100   90
3   0   0   0    0    0
4   0   0   0    0    0
5   0   0   0    0    0

In [6]:
#인덱스 지정
df8 = pd.DataFrame(exam_data,index=['r0','r1','r2'])
df8
#인덱스  정렬
df9 = df.sort_index(ascending=False)
df9

   이름  수학  영어   음악   체육
2  아인  70  95  100   90
1  승인  80  89   90   90
0  주민  90  98   85  100

In [ ]:
#특정 열의 데이터값을 기준으로 데이터프레임 정렬
df10 = df8.sort_value(by='2',ascending=True)
df10

In [12]:
#시리즈 연산
student1 = pd.Series({'국어':100,'영어':80,'수학':90})
print(student1)
#과목별점수 200으로 나누기
percentage = student1/200
percentage

국어    100
영어     80
수학     90
dtype: int64

국어    0.50
영어    0.40
수학    0.45
dtype: float64

In [15]:
student1 = pd.Series({'국어':100,'영어':80,'수학':90})
student2 = pd.Series({'수학':100,'국어':80,'영어':90})

student1
student2

# 두학생 점수 사칙연산
add = student1 + student2
sub = student1 - student2
mul =student1 * student2
div = student1 / student2
result = pd.DataFrame([add,sub,mul,div],
                     index = ['덧셈','뺄셈','곱셈','나눗셈'])
result

          국어      수학           영어
덧셈    180.00   190.0   170.000000
뺄셈     20.00   -10.0   -10.000000
곱셈   8000.00  9000.0  7200.000000
나눗셈     1.25     0.9     0.888889

In [17]:
# 누락데이터 NaN대신 0입력하는 예제
# 타이타닉 데이터셋
import seaborn as sns
titanic = sns.load_dataest('titanic')
df= titanic.loc[:,['age','fare']]
print(df.head())
print(type(df))

ModuleNotFoundError: No module named 'Seaborn'